#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      ~ valid_redirect_uris                        = [
          - "http://localhost:8080/*",
            # (3 unchanged elements hidden)
        ]
        # (25 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRP-SERVICE.module.client-roles.keycloak_role.ROLES["ADMIN"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "ADMIN"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRP-SERVICE.module.client-roles.keycloak_role.ROLES["MSPQI"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MSPQI"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRP-SERVICE.module.client-roles.keycloak_role.ROLES["PMP"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "PMP"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRP-WEB.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PRP-SERVICE/ADMIN"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRP-WEB.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PRP-SERVICE/MSPQI"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRP-WEB.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PRP-SERVICE/PMP"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.SWT.module.payara-client.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "ab06ae07-850c-4776-959c-83db82f43d24"
        name                                       = "SWT"
      ~ valid_redirect_uris                        = [
          + "http://localhost:8080/*",
          + "https://localhost:8081/*",
          + "https://swtadmind.hlth.gov.bc.ca/*",
            # (2 unchanged elements hidden)
        ]
        # (24 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-prp-service"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "cc4d80a5-4a1c-4d80-a2c3-59d3ebde880d"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-prp-service"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "ab6e0d99-9205-4625-8ea4-88835ddd36ae"
      + id        = (known after apply)
      + name      = "view-client-prp-service"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-prp-service"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "ab6e0d99-9205-4625-8ea4-88835ddd36ae"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-client-prp-service"
      + service_account_user_id = "a0112432-6122-4208-98b9-c3e4de346e18"
    }

Plan: 13 to add, 12 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*